{"Black-beans":{"title":"Black beans","links":["Guacamole"],"tags":["Mexican","tacos","Latin-American"],"content":"From Johnny’s memory.\n\nIMPORTANT! Don’t actually measure any ingredients. I didn’t when I wrote this recipe.. Just use these amounts as an approximate guide. Same with time, it’s all approximate.\n\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nPresoak a bunch of dried black beans the night before\nCook the beans with water and a few bay leaves for a couple/few hours\nWhile the beans cook, make a sofrito of olive oil, onions, peppers, garlic, cumin, coriander, oregano, chili powder, and salt.\nAdd the sofrito to the beans and continue to cook to desired consistency.\nTaste and add salt, cayenne, and lime juice to get just the right blend of flavours.\nServe with fresh Guacamole, pico de gallo, and other toppings on tacos, tostadas, or in burritos.\n\n\n\nFull recipe\nCooking time\n\nSoaking beans: overnight\nPrep: 30 min\nCooking: 3 - 4 hours\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredient1.5 kgblack beans, dried~2 litreswater (or use 1/2 vegetable stock)~6bay leavesolive oil2medium onions, chopped2 mediumbell peppers, choppedhot fresh chili peppers, minced (optional)6 clovesgarlic, minced6 tbspcumin4 tbspcoriander2 tbspchili powder2 tbsponion powder (optional)3 tsporeganoyour choicecumin or red chili flakes (optional)1.5 tspsalt1 - 2lime, juiced (or use vinegar)\nSteps\nPresoak the beans (night before):\n\nClean and rinse the dried beans\nPut beans in a large pot with twice as much water as beans, to soak overnight.\n\n\n🧑‍🔬 Science tells us you don’t even realllllly need to presoak the beans. But it can help speed up cooking time the next day. This can be helpful if the beans are older (though you wouldn’t necessarily be able to tell).\n\nPreparation\nCook the beans\nDrain and rinse the black beans (presoaked or not). Put them in a big pot and add enough cold water to cover the beans by a couple inches. (You can alternately replace 1/2 of the water with vegetable stock too, just watch the salt level at the end.) Add a few bay leaves and bring to a boil.\nOnce boiling, reduce to a simmer and cover. They will cook for anywhere between 1.5 to 5 hours, depending on the beans.\nStir every 20 minutes or so, and make sure they don’t stick to the bottom. If they do, the heat is too high. Reduce it. If the water level reaches the top of the beans, add more. The idea is to keep them covered, but not totally drowned, because at the end we want the beans to have a nice thick consistency and not be too watery/liquidy.\nPrepare the sofrito\nWhile the beans are cooking, you’ll make a sofrito. Chop the onions, bell peppers, chile peppers (if using, watch the heat though!), and garlic.\nIn a large skillet, heat a good amount of olive oil to medium heat. Add the onions and saute them for a couple minutes. Add in the peppers (bell and chile) and continue to sautee. Once everything is softened (around 5 - 8 minutes), add the garlic. Cook for a couple more minutes untill everything is fragrant.\nTurn the heat to low, add all the dried spices and salt. Add more olive oil so everything is well coated and stir well to combine. Take off heat.\nCombine everything\nWhen the beans are starting to get soft and the liquid starts to thicken, add the sofrito to the beans. Use a spatula to make sure you get all the good fragrant oils from the skillet.\nMix well and continue to cook the beans towards their desired consistency.\nAt this point, start tasting frequently, and adjust the following:\n\nSalt: add to achieve proper depth of flavour.\nHeat: add cayenne or red chili flakes to give the appropriate amount of heat\nOptional: Squeeze the juice of 1 or 2 limes in to give a hit of brightness.\n\nThe beans are finished when they arrive at the consistency you want. If for tacos, you’ll want them thicker. If you want to eat as a soup or put over rice (classic beans and rice) you might want them a bit more liquidy.\n\n💡 You can leave them on the more liquidy side, and store them this way. When you want some for tacos, refry them in a skillet and this will cook off some of the liquid making a great taco consistency.\n\nTo serve\nSo many ways to serve these beans:\n\nIn tacos, burritos, tostadas, etc. with Guacamole and other toppings\nWith tortilla chips, alongside guac and pico de gallo\nBeans and rice\nBlack bean bowls\n\nThis recipe makes a ton. Adjust according to your needs, make extra and freeze it to pull out whenever you want!"},"Guacamole":{"title":"Guacamole","links":[],"tags":["tacos","Mexican"],"content":"I lived in New Mexico for 6 years and learned a few things, but probably none so valuable as making incredible guacamole.\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nMash up two avocados in a bowl\nAdd minced red or white onion, jalapeño, garlic (small clove or 1/2), juice of 1/2 a lime, and 1/2 tsp salt\nMix well.\nAdd 1/2 chopped tomato and rough chopped cilantro to taste.\nServe immediately, or squeeze some extra lime juice over the top and refrigerate for up to a few hours.\n\n\n\nFull recipe\nCooking time\n\n10 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients2 mediumavocados1/4 cupwhite or red onion (if using yellow, use less)1/2 to 1jalapeño (taste the pepper first to see how hot it is)1 small clovegarlic1lime (juiced)1/2 tspsalt (more or less to taste)1/2 mediumtomatohandfulcilantro (optional)\nSteps\nSlice two avocados in half. Remove the seed and scoop out the flesh with a soup spoon into a large bowl. Roughly mash the avocado with the back of a fork.\n\n💡  If the flesh is hard to mash, put the avocado halves face down on a cutting board and fork mash them here, then scoop it back into the bowl.\n\nMince the onion, jalapeño, and garlic. Add it to the avocado using amounts that make sense to you. (Check how hot that jalapeño is, as they vary widely!)\nMix the ingredients quickly, but keep the avo chunky.\nSqueeze in the juice of 1/2 a lime, and add salt. Mix again and taste to check lime/salt balance. Add more of either if needed.\nChop the tomato, and wash, dry, and rough chop the cilantro. Add them to the guac, and mix again.\nTaste again. You probably need more salt. Avoid the urge to overdo it on the lime juice though, as too much will overpower the avocado.\nTo serve\nIf serving right away, put it in a nice bowl, stick a tortilla chip in it for a garnish, take a picture of it and put it on Instagram1. Then serve with tortilla chips, and use it as a garnish for the rest of your Mexican fiesta.\nIf not eating right away, squeeze a little more lime juice over the top, cover and refrigerate up to a few hours.\nFootnotes\n\n\nSeriously though, fuck Instagram and fuck Meta. They actively hurt humanity. If you want to post pretty pictures, try out Pixelfed. ↩\n\n\n"},"Hummus":{"title":"Hummus","links":[],"tags":["dips","Mediterranean","Middle-Eastern"],"content":"This is a hummus recipe. It’s taken from a million other recipes and adjusted to the way I like it, and honestly it just tastes best.\nStart from dried chickpeas, cook lots, and store them in the freezer for delicious fresh hummus on demand. (And always keep tahini and lemons on hand!)\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nSoak a bunch of chickpeas in water overnight, then cook them till tender with some crushed garlic, a halved onion, and bay leaves.\nDrain and cool the chickpeas, and freeze whatever you don’t want to use right away\nPrepare the hummus: Mince a clove of garlic in the food processor, then add chickpeas (however much you want to make), some spoonfuls of tahini, juice of 1 lemon, salt, cumin, pinch of cayenne, and glug of olive oil. Pulse, then run the food processor continuously.\nAdd ice cubes while running to achieve a silky smooth consistency.\nTaste for salt and spice levels.\nTop with zataar and drizzle of olive oil, then serve.\n\n\n\nFull recipe\nCooking time\n\nCooking dried chickpeas (can be done ahead)\n\novernight soak\n1 - 2 hours to cook\n\n\nPreparing the hummus:\n\n10 min\n\n\n\nIngredients\nFor the chickpeas\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1 kgdried chickpeaswater1 mediumonion2 - 3 clovesgarlic6bay leaves(optional)baking soda(optional)salt\nFor the hummus\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredientscooked chickpeasgarlictahinilemonolive oilsaltcumincayenne (optional)zataar\nSteps\nCooking the chickpeas\n\nThis can be done ahead of time, or you can cook a bunch of chickpeas and freeze them so they are ready whenever you want them. (You can also skip this step and just use canned.)\n\n\n1kg of dried chickpeas should be plenty for a few batches of hummus. They will more than double in size once they are soaked and cooked.\n\nRinse your dried chickpeas well in cold water, then put them in a large pot and cover them with plenty of water. Leave them to soak overnight.\nThe next day, drain the soaking water and give the chickpeas a rinse if they seem like they need it (if the water looks cloudy or dirty). Cover the chickpeas with fresh cold water. Peel an onion, cut it in half and throw it in. Peel and crush a couple garlic cloves and throw the pieces in the water. Add a few bay leaves.\n\n🧑‍🔬 At this point you can also add 1/2 teaspoon of baking soda or salt. This is optional, but can aid in softening the skins of chickpeas to make them cook faster and make the resulting consistency more smooth. In particular this can be a good step if the chickpeas still seem very hard after soaking. This usually indicates they are somewhat old (but still fine to use) and could use a little extra help. I haven’t personally tried the salt trick but there seems to be some science behind it (link needed…)\n\nCook the chickpeas until they are tender but not yet falling apart. Depending on the age of the beans it could be as fast as 20 min or as long at 2 hours.\n\n🚨 If you used baking soda pay attention, as they may soften fast and turn to mush of you don’t take them off in time.\n\nDrain the water and discard the bay leaves and onion. Cool and store the chickpeas, or move on to making hummus. (If you make hummus right away, make sure the chickpeas are fully cooled.)\nMaking the hummus\nEverything goes in a food processor. If you don’t have a food processor, an immersion blender is fine, or even a potato masher will work in a pinch.\n\n🧮 If you cooked 1kg of dried beans, you can make roughly four batches of hummus. As with most of these recipes, amounts are estimated, so make as much or as little as you like. The following steps assume about 1/4 of your total cooked chickpeas\n\n\nCrush and peel 1 large or 2 medium cloves of garlic and pulse them in the food processor until they are finely minced.\nAdd the chickpeas and pulse them a few times to break them up.\nAdd a few spoonfuls of tahini. No real measure here, but say anywhere up to 1/4 cup (0.5 dl).\nAdd around 1/2 teaspoon (3g) of salt\nAdd around 1 tsp of cumin and a pinch of cayenne. Be careful with the cayenne, the point is not to make spicy hummus but just a little will activate your tastebuds so the other flavours really pop.\nSqueeze in the juice of 1 lemon.\nAdd a healthy glug of olive oil\nStart pulsing the food processor, then leave it on as it starts to mix through all of the ingredients. It will still be chunky and dry but that’s fine.\nDrop in 1 - 2 ice cubes while the food processor is running and let them get crushed and mixed in.\n\nLeave the food processor running for at least a minute or two. Watch the consistency of the hummus, it should smooth out very nicely. If it’s not getting smooth add another ice cube or two, and/or some olive oil.\nStop the food processor and scrape down the sides if needed.\nKeep mixing it, stopping occasionally to check taste and consistency.\n\nTaste:\n\nCheck there is enough salt and add if needed.\nNote the cumin, you should taste a little but not have it overpower. Add more if needed\nAdd more lemon juice if it feels a little dull.\n\n\nConsistency:\n\nIf it seems thick and cement-like, continue to add some ice (or olive oil) and keep mixing.\n\n\n\nWhen it all seems nice and velvety smooth, and tastes delicious, you are done.\nTo serve\nPut the hummus into a nice serving dish. Sprinkle liberally with zataar and drizzle some olive oil over the top.\nServe with baguette, crackers, pita, pickles, olives, etc. Make it into sandwiches, use it in place of mayonnaise, have it on your toast in the morning, add it to your skin care routine, etc.\nIf you made lots of extra cooked chickpeas, you can just pull them out of your freezer and have fresh hummus in minutes that tastes better and is way cheaper than store-bought. Ultimate healthy life hack. ✅"},"index":{"title":"🌱 Welcome.","links":["Black-beans","Guacamole","Hummus"],"tags":[],"content":"\nWelcome to Let’s Dough, a recipe Rolodex put together by myself and my partner Mandeep. I make a lot of sourdough bread, but together we make so much incredible food it would be criminal not to share.\n\nRecipes so far\n\nBlack beans\nGuacamole\nHummus\nmore coming soon…\n\n\nAbout this wiki\nMandeep and I cook all the time. We are always trying new things, but also have our go-tos that we make over, and over, and over again. So this represents a selection of our go-to recipes that we’ve found, tried, adopted, adjusted, and tweaked to our liking.\nWe also happen to be vegetarian, so if you are looking for meat recipes, this ain’t it.\nI (Johnny) tend not to measure things too carefully, except when I am baking. So a lot of the recipes don’t have exact measurements. In my own cooking, I aim to taste a lot, and let my senses guide me. I believe that working with simple quality, whole, fresh ingredients that are sourced as locally as possible leads to great results.\n\nGood ingredients in ⇒ good food out.\n\nThis wiki also is a little test environment for notetaking and web design/development workflows. I’ve used Obsidian for years and have a lot of love for static site generators like Hugo and Jekyll. This site uses Quartz as a framework to publish an Obsidian vault of recipes. At some point maybe I’ll post some notes on my journey with different tools and workflows.\nBut for now, time to get back to the kitchen.\nLet’s dough!!!"}}