{"Beverages/Lemon-water":{"title":"Lemon water","links":[],"tags":["citrus","water"],"content":"Drink this every morning.\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nSqueeze 1/2 a lemon into water\nDrink it.\n\n\n\nFull recipe\nCooking time\n\n1 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1/2lemon1 glasswater\nSteps\nSqueeze 1/2 a lemon into water and drink it."},"Breads-and-baking/Whole-wheat-sourdough-bread":{"title":"Whole wheat sourdough bread","links":["Dips-dressings-and-spreads/Guacamole","Dips-dressings-and-spreads/Hummus"],"tags":["bread","sourdough","baking"],"content":"\nI started tinkering with sourdough in 2018. I made my first starter Rupert and eventually got my tools and techniques dialed in to produce consistently decent bread. I gave jars of Rupert to all my friends and they started baking too. In 2020, I was still experimenting and changed the formulation of the starter, dubbing it Mabel. She served us well until 2022 when we headed to Paris, land of incredible baked goods and very small apartment kitchens. Bread baking was on hiatus until we returned to Montréal in fall 2024. My friend Félix has been keeping his Rupert fork going and baking incredible loaves since the early days, and returned some starter to me. So behold, Rupert (Jr.) lives!\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the full recipe)\n\nOngoing:\n\nKeep a healthy sourdough starter going in your fridge\n(Get in touch if you need a little Rupert)\n\n\nThe night before:\n\nCreate your levain (sourdough mixture) and autolyse (flour and water: your base dough)\n\n\nOn the day:\n\nMix together the levain and autolyse; add salt. Knead everything together thoroughly\nBulk fermentation: Let the dough rest in a large covered bowl for several hours until it roughly doubles in size. Perform an occasional stretch fold (every 15 min at start and 1x per hour later). This step might take 3 - 8 hours depending on the dough, hydration, and temperature and humidity of the room.\nDump the dough out on a floured surface. Gently fold it together in thirds, then roll it up into a loaf-shaped oblong. Dust it with flour and put it in a banneton.\nSeal the banneton in a plastic bag and place it in the fridge overnight to proof.\n\n\nThe next day:\n\nPlace a large dutch oven on your oven and preheat to 230° C.\nTip your dough out onto parchment paper. Use a spray bottle to mist water on the top. Sprinkle with sesame seeds. Score the top of the loaf with your lame or razor.\nPlace in dutch oven. Add a couple ice cubes under the parchment paper to create steam.\nBake covered for 30 min, then remove cover and continue baking for another 15 - 25 minutes. Watch for appropriate color to decide when it’s done.\nImmediately remove from dutch oven and place on wire rack to cool completely.\n\n\n\n\n\nFull recipe\n\n\n                  \n                  About this recipe \n                  \n                \n\nThis recipe is mostly a refinement from my previous previous sourdough recipe, which in turn largely follows the excellent recipe and information from The Bread Code. I’ve adapted it to my own, taking into account the local Canadian flours available here, the climate, and my own experiences and preferences (especially the sesame seeds!)\nThe recipe is broken up into 4 steps: sourdough starter, day-before prep, day-of making, and next-day baking.\n\n\nCooking time\nThis bread is ideally made over three days, though the bulk of the work is on the second day.\n\nDay 1 (evening): 10 minutes\n\nFeed the starter / create levain\nMix the autolyse\n\n\nDay 2: Up to 1 hour of active work, 4 - 8 hours doing occasional folds\n\nMix the dough\nBulk fermentation\nShape loaf\n\n\nDay 3: 10 min active work, 1 hr baking time\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients100gsourdough starter (see starter section below)375gunbleached organic white bread flour125gorganic whole wheat flour350gwater12gsea saltrice flour (optional)sesame seeds\nYou’ll also want these tools:\n\nkitchen scale\nbanneton (proofing basket) - I prefer the batard-shape (oblong) with a cloth liner like these\nbread lame (or sharp razor blade) to score the top of the loaf\nspray bottle that can produce a fine mist\n\nSteps\n0. Sourdough starter\nBefore starting you need to have a good and healthy sourdough starter. Ideally this is one you have and maintain, because it needs regular feeding to stay fresh and usable. I won’t go into detail about how to make a starter or how to maintain it1, but essentially you want it to be nice and bubbly. You can achieve this by feeding it roughly once a week and keeping it in the refrigerator.\nTo feed the starter, mix equal parts flour (I like to use rye flour), water, and existing starter together. Discard the rest of the old starter.\nI. Day before prep\nThere are two steps to do the day before. One is essential, the other is optional.\n1: Create your levain (essential)\nWhat is levain? Essentially it is just an off-shoot of your starter, made the night before to guarantee that it is fresh, ready to use, and suits the properties of the bread you want to make. For simplicy’s sake, this levain will just be the same as my starter, measured to be the right quantity for my bread.\nYou want 100g of starter, so combine 33g of existing starter, 33g of flour (your choice, but I stick with rye as it gives the bread a nice earthy nutty flavour), and 33g of water. Mix it in a medium size bowl or container that you can cover well. Put it in a warm-ish spot in your kitchen and leave for between 8 and 16 hours (e.g., overnight). When you are ready to proceed the next day, it should be slightly liquidy and bubbly.\n\n💡 This is also probably a good time to feed your regular starter and stick it back in the fridge till you are ready to bake next.\n\n2: Create your autolyse (optional)\nWhat is an autolyse? It’s a fancy word for the flour and water you’ll use for your dough. Creating the autolyse beforehand lets the flour hydrate well and the dough it will become soft and silky smooth over time. Check for the “windowpane effect” after it has sat overnight, where you can pull a bit of the autolyse apart and it will stretch very thin but not tear, so the stretched centre is a bit translucent.\n\n🚨 You don’t have to do this the night before, you could do it the following morning, but make sure the autolyse has at least a couple hours to sit before adding the levain.\n\nGet a big bowl and find a lid that can cover it well.\nWeigh and combine your flours.2 Mix them together with a whisk.\nMeasure the water by weight (on a scale) or in a measuring cup (1g water = 1ml) and add to the flour. Mix the flour and water together by hand until it is well combined into a sticky ball. Use a dough scraper to get all the bits off the sides of the bowl (and off your fingers) and shape it as best you can into a ball.\nLeave the autolyse in the big bowl and cover it. Leave it overnight. (Or do this in the morning, leaving it for at least two hours before continuing.)\nII. On the day\n\n🎉 Today is the day you “make” the bread, though you won’t bake it until the following day. But this is where all the work is.\n\n1: Combine the ingredients\n\nGet our your autolyse. Everything will happen here in this bowl.\nPut it on a scale, and then weigh in 100g of your beautiful bubbly levain. (Your levain should be about 100g, but it doesn’t hurt to check the weight just to be sure.)\nUse your hands to mix and knead the levain and autolyse together.\nOnce they are getting well combined (~2 minutes of mixing), add the salt.\nContinue hand mixing/kneading until everything is very well combined, approximately 2 minutes more.\nMound it up in a ball and leave it in the bowl. Cover it with a lid (or wet tea towel if you don’t have a lid that fits).\n\n2: Bulk fermentation\nIn the bulk fermentation step, you’ll let the dough do its thing for a few hours while the naturally formed yeasts convert sugars into gas yada, yada, yada… until the dough gets a bit bubbly and roughly doubles in size.\n\n\n                  \n                  How do you tell when the buk fermentation is done? \n                  \n                \n\nOnce your dough is all combined in the last step, cut off a little golf-ball-sized chunk of the dough. Put it in a small narrow glass jar. Let it settle to the bottom, then put a small rubber band around it to mark where the dough comes up to on the side of the jar. This is your measuring tool. Keep an eye on this, and when the top of the dough has risen to double its size, you know the fermentation step is complete. See The Bread Code’s video (although I prefer a narrower jar to make it easier to read).\n\n\nPerform a stretch and fold on the dough each 15 minutes for the first 2 - 3 hours. This promotes gluten formation and strengthens the dough. So you can basically keep living your life, pause to do the stretch and fold, set at timer for another 15 minutes, and go back to your business until it goes off again.\n\n💡 Run your hands under water so they are wet when you fold the dough; it won’t stick and is much easier to work with. (And obviously, always wash your hands before you touch the dough!!)\n\nAfter about 2 hours, increase the time between folds til 30 minutes, and after about 4 or 5 hours, increase the time to 1 hour. The longer the fermentation time, the gentler you want to be with the dough too. All those little foamy bubbles mean it’s working, so go softly and try not to disrupt the dough too much.\n\n\n                  \n                  Ok fine but really how do I know when the fermentation is done? \n                  \n                \n\nThe exact amount of time for this step depends on a myriad of interconnected variables: the hydration (water amount) of the dough, type of flours used, the humidity, ambient room temperature, etc. It could be as short as 3 hours and as long as 8 hours or more. My fermentation times are usually somewhere between 5 and 7 hours, but it’s different every time.\nLook for these signs to know your fermentation is done:\n\nThe dough has many little air pockets (larger bubbles) under the surface.\nIt’s pliable and jiggly, but still maintains its surface tension and elasticity.\nYour little jar/measuring tool shows you it’s roughly doubled in size.\n\n🚨 DO NOT OVER FERMENT YOUR DOUGH!! If you do, all is lost; you’ll have a sad flat loaf. In my experience it is much better to under-ferment than over-ferment. Keep in mind the loaf will proof in the fridge overnight.\nAs with almost all of these steps, it just takes a lot of practice and experience. Eventually you will just start to be able read all the little telltale signs and hit it right every single time.\n\n\n3. Shaping the loaf\nWhen the dough reaches proper fermentation level, it’s ready to be shaped into a loaf and put in the fridge to proof overnight.\nPrepare your banneton by knocking out any old flour and dusting it with new rice flour. If you don’t have rice flour use whatever flour you have on hand.\nLiberally sprinkle bread or all purpose flour on a clean countertop. Gently flop the dough out of the bowl onto the flour and arrange it in a semi-rectangular or oval shape facing away from you (e.g., “portrait mode”). Make sure there is plenty of flour and it’s not sticking to the countertop.\nTaking care not to tear the dough, gently pull out the top third of the dough and fold it back onto itself. Repeat with the bottom third, so your dough is in three layers.\nEven it out as best you can then rotate it 90° so the long way is facing away from you. Starting at the distant end, gently stretch the dough and roll it up back towards you. You’ll end with a jiggly frumpy Swiss Cake Roll looking thing. Perfect!\nRoll the dough over so the seam created from the roll-up is on the bottom. Gently but firmly complete the shaping so it forms a nice oblong loaf shape. If your fermentation steps have gone right, the dough should have nice strength and stay nicely… loafed. You can pinch the ends together to give it more… loafeyness.\nInvert and place the loaf in the banneton so the nice side is down and the seam side is up. You can pinch the seam together if you like. (Consult numerous YouTube videos for good shaping technique!)\nDust it with more flour, place it in a plastic bag and seal it, and put it in the refrigerator overnight.\nIII. Baking day!\nYour bread will proof overnight and increase in size. Like with the bulk fermentation, it is important to know precisely when the bread is properly proofed and ready to bake. Too soon or too late and the bread won’t rise well and your loaf will be flat and stupid. 💩\n\n\n                  \n                  How to know that your bread is proofed and ready to bake \n                  \n                \n\n\nLook at it. Has it grown in size? Good. It might be ready…\nPoke it.\n\n⏳ If it quickly springs back, it’s not ready. Put it back in the fridge for another couple hours.\n🚫 If it barely springs back, or doesn’t at all, you’ve over-proofed. All is lost. Eat your sad flat bread in shame.\n✅ If it slowly springs back, you’ve hit it just right and it’s ready to bake.\n\n\n\n\n\n1. Preparation\nPut a big dutch oven into your oven on a low rack. Remove the other racks to give plenty of space. Preheat the oven to 230°C.\n\n🧑‍🔬 If you don’t have a dutch oven that can fit your loaf of bread, you can use a pizza stone if you have one, or barring that you can cook the loaf on a baking sheet. But each will give you slightly inferior results.\n\nThe dutch oven will keep steam in, creating the best environment for oven spring.\nThe pizza stone will not hold the steam in, but the mass of the stone will hold high and consistent heat.\nThe cooking sheet is the least optimal option, but if you’ve done a good fermentation and proof it should come out okay.\n\nIf using a dutch oven or pizza stone, let the oven run for an additional 20 to 30 minutes after preheating to ensure the dutch oven/stone is fully up to temperature.\n\nGet all the things you need together:\n\nLoaf out of fridge and plastic off\nLarge piece of parchment paper on counter\nA bowl or cup of sesame seeds\nFood-safe spray bottle of water, on fine mist setting\nYour bread lame or razor\nA bowl with a few ice cubes in it\nYour oven mitts to handle the dutch oven\n\n2. Baking\nBecause you want the dutch oven to maintain its optimal heat, you’ll want to do all the steps to get your loaf into the oven quickly and efficiently.\n\nTurn the loaf out onto middle of the parchment paper, with the bottom (in the banneton) now on top\nFinely mist the top with water - only lightly, this is just so the sesame seeds stick\nLiberally sprinkle sesame seeds over the top and on the sides. Pat them lightly so they stick but don’t disturb the dough too much.\nTake the bread lame or razor and score a curved line down the top of the loaf. Add other small scores on the side if you like too. (Again, there is an art to this, consult images and videos on the internet!)\nPut on your oven mitts and take the dutch oven out of the oven. Take the lid off. (If not using a dutch oven, you can adapt the remaining steps as necessary…)\nLift the parchment paper with the loaf on it and place it in the dutch oven.\nPlace a couple ice cubes in the dutch oven at the edges underneath the parchment paper so they don’t directly contact the loaf.\nPut your mitts back on, put the lid on the dutch oven and place it back in the oven.\n\nCook for 30 minutes, then take the lid off. Look to see if the loaf has risen nicely. This is the moment of truth! If things have gone perfectly the bread should have a nice ear on it.\nTurn the oven light on and continue cooking the loaf for 15 to 25 minutes. Check the color and wait for it to turn a nice rich brown. Try not to open the oven too much (thus the light on so you can watch it).\nWhen it is done, remove the dutch oven and carefully lift the loaf out by the parchment paper.\nPlace it on a wire rack to full cool before eating.\nTo serve\nIt is best to let the bread rest for a few hours before eating. When it first comes out the inside will still be quite moist and difficult to cut cleanly.\nAfter a few hours, you can eat it, or store it in a paper bag until the next day.\nIf you do eat it the same day, keep it in a paper bag for the rest of the day, and then place it in a plastic bag before you go to bed. Essentially you are controlling the amount of humidity by doing this. (Also this is good practice for fresh bakery breads you buy!)\nThere are a million ways to eat great bread. Our favourites:\n\nToast with almond butter in the mornings\nAvocado (or guacamole) toast!\nTomato, cheese and mayo sandwiches\nHummus sandwiches\nSliced fresh or toasted on a cheese plate\nAccompanying soups, salads, etc.\n\n\n\n                  \n                  Conclusion \n                  \n                \n\nBreadmaking is a true art form. I’m glad to have learned some basics, but truthfully there is so much more to learn and experiment with. This is only the beginning. It is also a nuanced and meticulous process that take a lot of practice to get just right. (It’s taken me a few hours just to write out this recipe 😅) But it is also fun to learn and the bread that comes out is honestly the best bread you will ever have… mostly because YOU MADE IT!!\nEnjoy!\n\n\nFootnotes\n\n\nSee The Bread Code’s amazingly informative and detailed “The Sourdough Framework” for all the information you need about making and maintaining your own starter. ↩\n\n\nThis recipe uses 75% white bread flour and 25% whole wheat. You can adjust these proportions as you like, but bear in mind that too much whole wheat flour can make your bread kind of cardboard-ey and will typically require higher hydration (more water). Using other types of flours can be fun too, though you will have to experiment with the other parameters of the recipe (amount of water, fermentation and proofing time, etc.) to get great results. ↩\n\n\n"},"Dips-dressings-and-spreads/Guacamole":{"title":"Guacamole","links":[],"tags":["tacos","Mexican"],"content":"I lived in New Mexico for 6 years and learned a few things, but probably none so valuable as making incredible guacamole.\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nMash up two avocados in a bowl\nAdd minced red or white onion, jalapeño, garlic (small clove or 1/2), juice of 1/2 a lime, and 1/2 tsp salt\nMix well.\nAdd 1/2 chopped tomato and rough chopped cilantro to taste.\nServe immediately, or squeeze some extra lime juice over the top and refrigerate for up to a few hours.\n\n\n\nFull recipe\nCooking time\n\n10 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients2 mediumavocados1/4 cupwhite or red onion (if using yellow, use less)1/2 to 1jalapeño (taste the pepper first to see how hot it is)1 small clovegarlic1lime (juiced)1/2 tspsalt (more or less to taste)1/2 mediumtomatohandfulcilantro (optional)\nSteps\nSlice two avocados in half. Remove the seed and scoop out the flesh with a soup spoon into a large bowl. Roughly mash the avocado with the back of a fork.\n\n💡  If the flesh is hard to mash, put the avocado halves face down on a cutting board and fork mash them here, then scoop it back into the bowl.\n\nMince the onion, jalapeño, and garlic. Add it to the avocado using amounts that make sense to you. (Check how hot that jalapeño is, as they vary widely!)\nMix the ingredients quickly, but keep the avo chunky.\nSqueeze in the juice of 1/2 a lime, and add salt. Mix again and taste to check lime/salt balance. Add more of either if needed.\nChop the tomato, and wash, dry, and rough chop the cilantro. Add them to the guac, and mix again.\nTaste again. You probably need more salt. Avoid the urge to overdo it on the lime juice though, as too much will overpower the avocado.\nTo serve\nIf serving right away, put it in a nice bowl, stick a tortilla chip in it for a garnish, take a picture of it and put it on Instagram1. Then serve with tortilla chips, and use it as a topping for the rest of your Mexican fiesta.\nIf not eating right away, squeeze a little more lime juice over the top, cover and refrigerate up to a few hours.\nFootnotes\n\n\nSeriously though, fuck Instagram and fuck Meta. They actively hurt humanity. If you want to post pretty pictures, try out Pixelfed. ↩\n\n\n"},"Dips-dressings-and-spreads/Hummus":{"title":"Hummus","links":[],"tags":["mezze","Mediterranean","Middle-Eastern"],"content":"This is a hummus recipe. It’s taken from a million other recipes and adjusted to the way I like it, and honestly it just tastes best.\nStart from dried chickpeas, cook lots, and store them in the freezer for delicious fresh hummus on demand. (And always keep tahini and lemons on hand!)\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nSoak a bunch of chickpeas in water overnight, then cook them till tender with some crushed garlic, a halved onion, and bay leaves.\nDrain and cool the chickpeas, and freeze whatever you don’t want to use right away\nPrepare the hummus: Mince a clove of garlic in the food processor, then add chickpeas (however much you want to make), some spoonfuls of tahini, juice of 1 lemon, salt, cumin, pinch of cayenne, and glug of olive oil. Pulse, then run the food processor continuously.\nAdd ice cubes while running to achieve a silky smooth consistency.\nTaste for salt and spice levels.\nTop with zataar and drizzle of olive oil, then serve.\n\n\n\nFull recipe\nCooking time\n\nCooking dried chickpeas (can be done ahead)\n\novernight soak\n1 - 2 hours to cook\n\n\nPreparing the hummus:\n\n10 min\n\n\n\nIngredients\nFor the chickpeas\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1 kgdried chickpeaswater1 mediumonion2 - 3 clovesgarlic6bay leaves(optional)baking soda(optional)salt\nFor the hummus\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredientscooked chickpeasgarlictahinilemonolive oilsaltcumincayenne (optional)zataar\nSteps\nCooking the chickpeas\n\nThis can be done ahead of time, or you can cook a bunch of chickpeas and freeze them so they are ready whenever you want them. (You can also skip this step and just use canned.)\n\n\n1kg of dried chickpeas should be plenty for a few batches of hummus. They will more than double in size once they are soaked and cooked.\n\nRinse your dried chickpeas well in cold water, then put them in a large pot and cover them with plenty of water. Leave them to soak overnight.\nThe next day, drain the soaking water and give the chickpeas a rinse if they seem like they need it (if the water looks cloudy or dirty). Cover the chickpeas with fresh cold water. Peel an onion, cut it in half and throw it in. Peel and crush a couple garlic cloves and throw the pieces in the water. Add a few bay leaves.\n\n🧑‍🔬 At this point you can also add 1/2 teaspoon of baking soda or salt. This is optional, but can aid in softening the skins of chickpeas to make them cook faster and make the resulting consistency more smooth. In particular this can be a good step if the chickpeas still seem very hard after soaking. This usually indicates they are somewhat old (but still fine to use) and could use a little extra help. I haven’t personally tried the salt trick but there seems to be some science behind it (link needed…)\n\nCook the chickpeas until they are tender but not yet falling apart. Depending on the age of the beans it could be as fast as 20 min or as long at 2 hours.\n\n🚨 If you used baking soda pay attention, as they may soften fast and turn to mush of you don’t take them off in time.\n\nDrain the water and discard the bay leaves and onion. Cool and store the chickpeas, or move on to making hummus. (If you make hummus right away, make sure the chickpeas are fully cooled.)\nMaking the hummus\nEverything goes in a food processor. If you don’t have a food processor, an immersion blender is fine, or even a potato masher will work in a pinch.\n\n🧮 If you cooked 1kg of dried beans, you can make roughly four batches of hummus. As with most of these recipes, amounts are estimated, so make as much or as little as you like. The following steps assume about 1/4 of your total cooked chickpeas\n\n\nCrush and peel 1 large or 2 medium cloves of garlic and pulse them in the food processor until they are finely minced.\nAdd the chickpeas and pulse them a few times to break them up.\nAdd a few spoonfuls of tahini. No real measure here, but say anywhere up to 1/4 cup (0.5 dl).\nAdd around 1/2 teaspoon (3g) of salt\nAdd around 1 tsp of cumin and a pinch of cayenne. Be careful with the cayenne, the point is not to make spicy hummus but just a little will activate your tastebuds so the other flavours really pop.\nSqueeze in the juice of 1 lemon.\nAdd a healthy glug of olive oil\nStart pulsing the food processor, then leave it on as it starts to mix through all of the ingredients. It will still be chunky and dry but that’s fine.\nDrop in 1 - 2 ice cubes while the food processor is running and let them get crushed and mixed in.\n\nLeave the food processor running for at least a minute or two. Watch the consistency of the hummus, it should smooth out very nicely. If it’s not getting smooth add another ice cube or two, and/or some olive oil.\nStop the food processor and scrape down the sides if needed.\nKeep mixing it, stopping occasionally to check taste and consistency.\n\nTaste:\n\nCheck there is enough salt and add if needed.\nNote the cumin, you should taste a little but not have it overpower. Add more if needed\nAdd more lemon juice if it feels a little dull.\n\n\nConsistency:\n\nIf it seems thick and cement-like, continue to add some ice (or olive oil) and keep mixing.\n\n\n\nWhen it all seems nice and velvety smooth, and tastes delicious, you are done.\nTo serve\nPut the hummus into a nice serving dish. Sprinkle liberally with zataar and drizzle some olive oil over the top.\nServe with baguette, crackers, pita, pickles, olives, etc. Make it into sandwiches, use it in place of mayonnaise, have it on your toast in the morning, add it to your skin care routine, etc.\nIf you made lots of extra cooked chickpeas, you can just pull them out of your freezer and have fresh hummus in minutes that tastes better and is way cheaper than store-bought. Ultimate healthy life hack. ✅"},"Dips-dressings-and-spreads/Salad-dressing":{"title":"Salad dressing","links":[],"tags":["salad","kale"],"content":"\nWhat to say? I (Mandeep) have been making this dressing for about 15 years. Maybe it could also be called as a health tonic as there’s enough garlic and apple cider vinegar in it. Make a homemade salad dressing you love and you’ll be ruined for ever going towards store-bought options.\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nFinely chop garlic\nAdd apple cider vinegar first\nAdd honey, mustard, olive oil\nShake to emulsify\n\n\n\nFull recipe\nPreparation time\n\n10 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1-2 clovesgarlic (depends on size)2 tbspapple cider vinegar1 tsphoney1/2 tspDijon mustard3.5 tbspextra virgin olive oil\nSteps\n\n💡I usually keep a glass jar or bottle reserved for this salad dressing\n\n\nFinely chop garlic and put into a bottle or bowl.\nDrown the garlic in apple cider vinegar so that its “bite” is tamed.\nAdd honey and Dijon mustard.\nAdd olive oil last and then shake shake shake or stir stir stir.\nWill keep in fridge for several days.\nI don’t measure the dressing above, you can easily adjust to taste.\n\n\n\n                  \n                  Substitutions \n                  \n                \n\n\n💡 Substitute balsamic vinegar if you like\n💡 Substitute maple syrup for honey if you like\n🚨 I don’t recommend substituting yellow mustard, it makes the dressing too vinegar-y.\n👍 Lots of other improvisations with different oils and vinegars possible though!\n\n\n\nTo serve\n\n💡Take it out of fridge 15 minutes before using as the olive oil will be solid and need to liquify. Or run the bottle under hot water if you have no time.\n\nPut dressing on salad. Add salt and pepper as needed.\nIf using it on a kale salad: be sure to break the kale into smaller pieces, removing the stem, and massage kale leaves with olive oil before adding the dressing."},"Linked-recipes":{"title":"Linked recipes","links":["Breads-and-baking/Whole-wheat-sourdough-bread"],"tags":["links"],"content":"In addition to our own recipes (which are often adaptations of recipes that came before - let’s not reinvent the wheel here folks!), there are a ton of great recipes that we find and use online.\nSo partially for us to easily find, but also to share, here is a growing list of our favourites:\nBreakfast\n\nSourdough pancakes (use up all that leftover sourdough starter!!)\n\nSoups and salads\n\nItalian-style lentil soup (add potato and Beyond Meat Hot Italian sausage)\nFattoush Salad Recipe\n\nMains\n\nLebanese Mujadara - easy lentils and rice dish, serve with fattoush 👆\nSweet and sour (pineapple and tofu) stir fry\nVegan mushroom pot pie - Holiday tradition!\nTofu Jalfrezi (see also this recipe for a more in-depth and traditional vegetable jalfrezi, which can be useful to cross-reference)\n"},"Mains/Black-beans":{"title":"Black beans","links":["Dips-dressings-and-spreads/Guacamole"],"tags":["Mexican","tacos","beans"],"content":"From Johnny’s memory.\n\n🚨 IMPORTANT! Don’t actually measure any ingredients. I didn’t when I wrote this recipe.. Just use these amounts as an approximate guide. Same with time, it’s all approximate.\n\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nPresoak a bunch of dried black beans the night before\nCook the beans with water and a few bay leaves for a couple/few hours\nWhile the beans cook, make a sofrito of olive oil, onions, peppers, garlic, cumin, coriander, oregano, chili powder, and salt.\nAdd the sofrito to the beans and continue to cook to desired consistency.\nTaste and add salt, cayenne, and lime juice to get just the right blend of flavours.\nServe with fresh Guacamole, pico de gallo, and other toppings on tacos, tostadas, or in burritos.\n\n\n\nFull recipe\nCooking time\n\nSoaking beans: overnight\nPrep: 30 min\nCooking: 3 - 4 hours\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredient1.5 kgblack beans, dried~2 litreswater (or use 1/2 vegetable stock)~6bay leavesolive oil2medium onions, chopped2 mediumbell peppers, choppedhot fresh chili peppers, minced (optional)6 clovesgarlic, minced6 tbspcumin4 tbspcoriander2 tbspchili powder2 tbsponion powder (optional)3 tsporeganoyour choicecumin or red chili flakes (optional)1.5 tspsalt1 - 2lime, juiced (or use vinegar)\nSteps\nPresoak beans\n\n📆 Do this step the night before.\n\n\nClean and rinse the dried beans\nPut beans in a large pot with twice as much water as beans, to soak overnight.\n\n\n\n                  \n                  To presoak or not? \n                  \n                \n\n🧑‍🔬 Science tells us you don’t even realllllly need to presoak the beans. But it can help speed up cooking time the next day. This can be helpful if the beans are older (though you wouldn’t necessarily be able to tell).\n\n\nPreparation\nCook the beans\nDrain and rinse the black beans (presoaked or not). Put them in a big pot and add enough cold water to cover the beans by a couple inches. (You can alternately replace 1/2 of the water with vegetable stock too, just watch the salt level at the end.) Add a few bay leaves and bring to a boil.\nOnce boiling, reduce to a simmer and cover. They will cook for anywhere between 1.5 to 5 hours, depending on the beans.\nStir every 20 minutes or so, and make sure they don’t stick to the bottom. If they do, the heat is too high. Reduce it. If the water level reaches the top of the beans, add more. The idea is to keep them covered, but not totally drowned, because at the end we want the beans to have a nice thick consistency and not be too watery/liquidy.\nPrepare the sofrito\nWhile the beans are cooking, you’ll make a sofrito. Chop the onions, bell peppers, chile peppers (if using, watch the heat though!), and garlic.\nIn a large skillet, heat a good amount of olive oil to medium heat. Add the onions and saute them for a couple minutes. Add in the peppers (bell and chile) and continue to sautee. Once everything is softened (around 5 - 8 minutes), add the garlic. Cook for a couple more minutes untill everything is fragrant.\nTurn the heat to low, add all the dried spices and salt. Add more olive oil so everything is well coated and stir well to combine. Take off heat.\nCombine everything\nWhen the beans are starting to get soft and the liquid starts to thicken, add the sofrito to the beans. Use a spatula to make sure you get all the good fragrant oils from the skillet.\nMix well and continue to cook the beans towards their desired consistency.\nAt this point, start tasting frequently, and adjust the following:\n\nSalt: add to achieve proper depth of flavour.\nHeat: add cayenne or red chili flakes to give the appropriate amount of heat\nOptional: Squeeze the juice of 1 or 2 limes in to give a hit of brightness.\n\nThe beans are finished when they arrive at the consistency you want. If for tacos, you’ll want them thicker. If you want to eat as a soup or put over rice (classic beans and rice) you might want them a bit more liquidy.\n\n💡 You can leave them on the more liquidy side, and store them this way. When you want some for tacos, refry them in a skillet and this will cook off some of the liquid making a great taco consistency.\n\nTo serve\nSo many ways to serve these beans:\n\nIn tacos, burritos, tostadas, etc. with Guacamole and other toppings\nWith tortilla chips, alongside guac and pico de gallo\nBeans and rice\nBlack bean bowls\n\nThis recipe makes a ton. Adjust according to your needs, make extra and freeze it to pull out whenever you want!"},"Mains/Lentil-burgers":{"title":"Lentil burgers","links":[],"tags":["burgers","lentils","beans"],"content":"We wanted to establish a solid base veggie burger recipe, so after consulting, trying, and combining several different online recipes (shout out to Chef John’s (not me!) Meatless Meatballs we came up with this one. It is infinitely adjustable: swap the lentils for black beans or another protein; use quinoa instead of oats, experiment with different vegetables, herbs, and spices. If you want to go full vegan you can also skip the eggs and use flax seed or another thickener, but the eggs do a pretty perfect job of binding everything together.\n\n💡TIP: Make a bunch and freeze them; then you can just pull one or two out for a quick and easy dinner.\n\n\n\n                  \n                  🥱 TL;DR (read on for the full recipe)\n                  \n                \n\n\nCook some green or brown lentils\nLightly sautée some small-diced veggies\nMix lentils, veggies, oats, bread crumbs, eggs, fresh herbs, spices, salt and pepper together in a bowl.\nChill in fridge, then form patties and freeze.\n\n\n\nFull recipe\nCooking time\n\nPrep: 45min\nCooking the burgs: 10 min\n\nIngredients\n\n\n                  \n                  Important\n                  \n                \n\nNothing here was really measured, but approximate ratios would be:- equal parts lentils, oats, cooked veg mixture- 1/2 part bread crumbs (adjust for proper moisture so everything binds)- eggs, your call to make everything bind together well- herbs and spices as desired\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredientsgreen (small french) lentilsdiced oniondiced bell peppershredded carrotdiced mushroomsgarlicquick cooking oatsbread crumbsflat parsley2 - 4 eggsherbs: oregano/de provence/etc. (as desired)spices: cayenne pepper/cumin/turmeric/etc. (as desired)salt and pepperolive oil\nSteps\n\nEarlier in the day cook the lentils until soft, but not overly mushy (around 20 min). Drain, rinse quickly, and let them cool\nCook the veggies in a skillet w/ olive oil, in order:\n\nonion\npepper\nmushrooms\ngarlic\nsalt &amp; pepper\n(add any other things as desired)\n\n\nIn a big bowl, mix:\n\ncooked veggies (cooled a bit)\noats and bread crumbs\neggs\nparsley and other herbs/spices\nsalt &amp; pepper\n\n\n(Optional) Put mixture in fridge for a while, as it cools it should firm up a bit\nShape into patties and put in freezer. For best results separate them with parchment paper or something so they don’t stick together when you take them out.\n\nTo serve\nWhen ready to cook, take them out of freezer a little before so they’re not frozen solid, but can still be pretty hard (will help them retain their shape!)"},"Mains/Spicy-Vodka-Rigatoni":{"title":"Spicy Vodka Rigatoni","links":[],"tags":["Italian","pasta"],"content":"\n🚨 GUEST CHEF ALERT!!! 🚨\nThis recipe has become a family favourite thanks to my niece Erin, who is also known to make pasta from scratch on occasion. The beauty of this meal is its outstanding ratio of deliciousness to time spent cooking. It’s simple, fast and exquisite!\n\n\n                  \n                  🥱 TL;DR (read on for the full recipe)\n                  \n                \n\n\nCook a bunch of rigatoni or similar pasta. Saving some pasta water when you drain it.\nSaute shallots and garlic in a large skillet. Add tomato paste, vodka, and cream.\nSeason with salt, pepper, and red pepper flakes, add rigatoni, and finish with butter, parm, and a little pasta water.\n\n\n\n\nFull recipe\nCooking time\n\n20 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1 - 2shallots, diced2 - 3cloves garlicolive oil6oz cantomato paste (or equivalent to that amount if you use a tube of paste)2 tbspvodka1 cupheavy creamsaltpepperred pepper flakesgrated parmesan cheese2 tbspbutterbasil (if you’re feeling fancy)450 grigatoni (basically a bag)\nSteps\n\nCook rigatoni pasta al dente- be sure to save some pasta water.\nCook down the garlic and shallots in a good bit of olive oil until the shallots are softened.\nAdd in tomato paste and let that cook off for a few minutes - until it’s not as bright in color.\nAdd in vodka and stir until the liquid is cooked off.\nAdd in heavy cream and stir until combined. Then season to taste with salt, pepper, and a generous amount of red pepper flakes.\nReduce heat to low. Add in your rigatoni. Add butter, a good sprinkle of parm, and a bit of your pasta water to bring everything together.\n\nTo serve\nServe with a bit of basil and more parm!\n\nThanks again to Erin, Let’s Dough’s first guest contributor!\n\nYou can see what else Erin has going on over on her Instagram page.\n"},"Mains/Tofu-scramble-(dinner)":{"title":"Tofu scramble (dinner)","links":[],"tags":["tofu","quick"],"content":"\nThis is our dinner version of a tofu scramble: a delicious, repeatable, use-whatever-you-have-in-your-fridge sort of recipe.  Mandeep says it came from an online recipe a long time back. I say it came from our heads, but she’s probably right. If we find the link we’ll post it 😁\n\n\n                  \n                  🥱 TL;DR \n                  \n                \n\n(read on for the long version)\n\nChop an onion, garlic, and whatever other vegetables you want to throw in. Chop up some fresh herbs.\nHeat up a large skillet, add olive oil and start adding the vegetables to cook one by one in order of required cooking time.\nAbout 6 minutes in, add garlic, herbs, and spices.\nCrumble in a block of tofu and keep cooking and mixing.\nAdd the softest/leafiest vegetables last, along with more fresh herbs.\nTake off heat, plate it with more herbs sprinkled over the top. Serve with vegan mayo, a starch, and salad.\n\n\n\nFull recipe\nCooking time\n\nPrep time: 20 min\nCook time: 20 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients1 blocktofu (extra firm)~2 tbsp +++olive oil (add more as needed)1 mediumonion1 mediumbell pepper*3 clovesgarlic1 small headbroccoli (or 1/2 a large head)*300g / 2 cupsmushrooms (1 package or however many you want)*lotsfresh thyme, dill, or other fresh herbs on hand*can use dried herbs if needed, but fresh really makes the dish~1 tbspturmeric~1 tbspcumin (ground)~2 tspcoriander (ground)~1/4 tspcayenne (optional, or to taste)~1/2 tspsalt~1/4 cupnutritional yeast1limea few sprigsfresh parsley\n*A note about the vegetables and herbs: You can really put whatever vegetables you want in this, or whatever you have on hand: asparagus, carrots, cauliflower, potatoes, green beans, zucchini, cabbage, hearty leafy greens like swiss chard or bok choy, kale too, other root vegetables, you name it. Go nuts, it’s your scramble. The important thing to pay attention to is the required cooking time for each. Things like potatoes and root vegetables need to go in early, and save any leafy things for the end.\nSame with the herbs: fresh herbs really make the dish and you can use a variety. But use some caution, and think about how they will go with the other spices you put in - e.g., rosemary, sage, and cumin/coriander isn’t necessarily a great combo. So, as always, experiment and use your taste buds to guide you to lovely combinations. For dried herbs, herbs de provence go a long way.\nSteps\n\n💡To be neat and orderly, chop all your vegetables first, then you will add them to your skillet one by one, based on the time they each need to cook. Functionally speaking though, chop the first ones to get them cooking, then you can be chopping the next as they cook, throw them in, move on to the next, etc.\n\nChop the onion and peppers into thin strips. Finely mince the garlic. Chop up the broccoli into smallish florets (if you want you can peel and chop the stems too), chop the mushrooms to similar dimensions as the broccoli (chunks are better than sliced in this recipe), and similarly chop up any other veggies you are going to use.\nGet out your biggest skillet and heat it to medium. Add a liberal glug of olive oil.\nAdd the onions and cook for a couple minutes until the all break apart and just barely start to soften. Then add the bell peppers. If you have other veggies that require longer cooking times (carrots, potatoes, broccoli stems, etc.) add them here too. Cook until things start to soften a bit, maybe 5 min. more. Add the garlic, spices, salt, and half of the fresh herbs. If using dried herbs, add them here too. Stir it all together, adding more olive oil if everything is getting dry. Everything should start to smell nice and fragrant now.\nCheck your heat, things should be sizzling nicely but not burning or sticking to the bottom. Adjust as necessary.\nAdd the broccoli next and any other medium-cook-time veggies. Mix it in well.\nThen break the tofu apart with your hands and crumble it in. Pieces can vary in size, but go for a median size of 3/4” cubes. Mix together well with everything.\nAdd in the mushrooms and combine well. Cook for a few minutes more until they start breaking down, then add your leafy vegetables (if using), most of the rest of the herbs (reserving a little for a fresh garnish), and the nutritional yeast. Combine well and continue stirring.\nTaste and adjust salt and spices as needed. If everything is too dry add some more olive oil (or if really health conscious, add a little water). Check for the doneness of the different vegetables - they should be cooked but still have a little crunch to them. Total cooking time should be somewhere around 20 minutes.\nWhen everything is done to your liking take it off the heat. Optional: squeeze the juice if 1/2 lime in and mix to give it a nice brightness.\nTo serve\nPlate it, topping with remaining fresh herbs and/or chopped fresh parsley, and a wedge of lemon.\nA dollop of vegenaise (or regular mayo) and some hot sauce is a great accompaniment.\nOur go-to service is this scramble with a side of baked sweet potato1 and crunchy kale salad.\nFootnotes\n\n\nFast sweet potato recipe: cube a large sweet potato; toss with olive oil, salt, and pepper; bake on parchment paper-covered baking sheet at 175°C / 375°F for about 20 min, turning once. Take out, place in large bowl and toss with a little more salt. Boom. Delish. 💥 ↩\n\n\n"},"Soups/Potato-Leek-Soup":{"title":"Potato Leek Soup","links":["Breads-and-baking/Whole-wheat-sourdough-bread"],"tags":["potato","leek","vegan","cashews"],"content":"\nIt’s winter; I’m sick on the couch and all I want is to eat soup and stop blowing my nose.\nThis recipe is a winter staple and takes me way back to childhood. I have no idea how far this has strayed from the soup I remember, but it’s pretty standard. As written, it’s totally vegan, but real cream (and butter) can easily be subbed back in if desired. Either way, the end result is incredible.\n\n\n                  \n                  🥱 TL;DR (read on for the full recipe)\n                  \n                \n\n\nSauté leeks, in a large dutch oven or pot. Add garlic, herbs, and red pepper flakes\nAdd diced potatoes and vegetable stock and cook until potatoes are tender.\nWhile soup is simmering, blend soaked raw cashews and water to make cashew creme\nSeason with salt and pepper and more fresh herbs.\nStir in cashew (or regular 35%) creme to bring it all together.\n\n\n\nFull recipe\nCooking time\n\nActive: 20 min\nCooking: ~20 min\n\nIngredients\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmountIngredients5 - 6 medpotatoes (Yukon Gold is nice but any will do)2 - 3leeks (2 if large, 3 if medium, more if you feel like it)1 medonion (optional, for extra alliacious-ness)3 - 5cloves garlicthyme (fresh)dill (fresh)other fresh herbs (as desired)red pepper flakesolive oil~1L (~4 cups)vegetable stock150g (1 cup)raw cashews*\n\n\n                  \n                  To vegan or not to vegan? \n                  \n                \n\nIf going the vegan route, the raw cashews will make a very nice creme to finish off the soup. You can also use a vegan cooking creme if you prefer. If not vegan, you can use heavy creme (35% in Canada), and feel free to toss in a little butter to richen it up too.\n\n\nSteps\nPrep: mise en place, people!\n\nWash potatoes and cut into large cubes, leaving the skin on.\nTrim green and base parts of leeks and discard. Slice the remaining white parts in half length-wise. Wash them thoroughly. If they are very dirty, submerge the halves in a large bowl of cold water and let them soak for a while.\nOnce clean, roughly chop the leeks on a bias (diagonal).\nMince your garlic and dice the onion if using. (Onion rule of thumb - if you have tons of leeks, don’t bother, but if not, that extra onion adds a lot)\nWash your herbs.\nCover 150g (around 1 cup) of raw cashews with very hot water and let them soak. Optionally, smash a clove of garlic and put it in. (Skip this step if using regular creme)\n\nLet’s cook:\n\nHeat a large dutch oven or pot to medium heat and add a generous amount of olive oil.\nAdd the leeks and onion (if using) and sauté until they start to soften. Mind that they don’t brown.\nAdd garlic and red pepper flakes.\nTake a good bunch of dill and thyme (or any other fresh herbs) and make a little bundle, tying it with some cooking twine. Throw it in and mix it around. (Or use a rubber band, though maybe that’s not great for cooking? But either way you’ll fish it out later…)\nAfter the garlic and herbs have cooked another minute or so, add the potatoes and stir them around for a couple minutes until everything is well mixed and sizzling.\nAdd enough vegetable stock to cover everything well. If you’re not going full vegan, feel free to add some butter here.\nCover and reduce to a simmer.\nStir and check the firmness of the potatoes every few minutes.\nWhile the soup cooks, make your cashew creme (if using). Ensuring there is enough water still covering the cashews, use a hand blender to blend it all into a creme. Adjust the amount of water to get the right consistency (start with less, and add as you go). Taste and add salt as needed.\nWhen the potatoes are soft, fish out the herb bundle and throw it away.\nUse a potato masher or hand blender to break down some of the potatoes. It’s up to you how creamy you want to make the soup - I usually like to leave it a bit chunky.\nAdd more fresh herbs and salt and pepper to taste. Everything should taste pretty great now.\nFinal step: stir in a good amount of the cashew creme (or regular creme). This will give the soup an exceptional mouthfeel.\n\n\nTo serve\nDish out into a shallow bowl. Add a swizzle of creme in the bowl if you are feeling fancy. Top with more fresh dill, a dusting of paprika, and fresh cracked pepper.\nServe with baguette, crusty sourdough bread, or grilled cheese sandwich, and a fresh (kale) salad."},"index":{"title":"🌱 Welcome.","links":["Breads-and-baking/Whole-wheat-sourdough-bread","Beverages/Lemon-water","Dips-dressings-and-spreads/Salad-dressing","Dips-dressings-and-spreads/Guacamole","Dips-dressings-and-spreads/Hummus","Soups/Potato-Leek-Soup","Mains/Black-beans","Mains/Lentil-burgers","Mains/Spicy-Vodka-Rigatoni","Mains/Tofu-scramble-(dinner)","Linked-recipes"],"tags":[],"content":"\nHi. I’m Johnny. Welcome to Let’s Dough, a recipe Rolodex put together by myself and my partner Mandeep. I make a lot of sourdough bread, but together we make so much other incredible food it would be criminal not to share.\n\nRecipes so far\n\n🍋 Lemon water\n🥗 Mandeep’s salad dressing ✨ new recipe!\n🥑 Guacamole\n🥙 Hummus\n🍲 Potato Leek Soup ✨ new recipe!\n🌮 Black beans\n🍔 Lentil burgers\n🍝 Spicy Vodka Rigatoni ✨ new recipe!\n🥚 Tofu scramble (dinner)\n🍞 Whole wheat sourdough bread\nmore coming soon…\n\n…Plus: here is a growing list of online recipe links that we can recommend.\n\nAbout the recipes\nMandeep and I cook all the time. We are always trying new things, but also have our go-tos that we make over, and over, and over again. So this represents a selection of our go-to recipes that we’ve found, tried, adopted, adjusted, and tweaked to our liking.\nWe also happen to be vegetarian, so if you are looking for meat recipes, this ain’t it.\nI (Johnny) tend not to measure things too carefully, except when I am baking. So a lot of the recipes don’t have exact measurements. In my own cooking, I aim to taste a lot and let my senses guide me. I believe that working with simple, quality, whole, fresh ingredients that are sourced as locally as possible leads to great results.\n\nGood ingredients in ⇒ good food out.\n\nAbout this wiki\nThis wiki also is a little test environment for notetaking and web design/development workflows. I’ve used Obsidian for years and have a lot of love for static site generators like Hugo and Jekyll. This site uses Quartz as a framework to publish an Obsidian vault of recipes. At some point maybe I’ll post some notes on my journey with different tools and workflows.\n\nContact\nIf you like some of the recipes here, have questions, or have ideas and comments, we’d love to hear them!\nSend us an email at letsdough [at] johnnyvenom [dot] com\nBut for now, it’s time to get back to the kitchen.\nLet’s dough!!!"}}